energia/cc13xx-core/variants/CC1350STK/Board_init.c
/* The device-specific GPIO_config structure */
const GPIOCC26XX_Config GPIOCC26XX_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = ~0
};

/*
 *  ======== Board_initGPIO ========
 */
void Board_initGPIO(void)
{
    /* set up initial GPIO pin configurations */
    GPIO_init();
}

/*
 *  ============================= UART ===================================
*/

/* Include drivers */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26XX.h>


extern void UARTCC26XX_close(UART_Handle handle);
extern int_fast16_t UARTCC26XX_control(UART_Handle handle, uint_fast16_t cmd,
        void *arg);
extern void UARTCC26XX_init(UART_Handle handle);
extern UART_Handle UARTCC26XX_open(UART_Handle handle, UART_Params *params);
extern int_fast32_t UARTCC26XX_read(UART_Handle handle, void *buffer, size_t size);
extern void UARTCC26XX_readCancel(UART_Handle handle);
extern int_fast32_t UARTCC26XX_readPolling(UART_Handle handle, void *buffer,
        size_t size);
extern int_fast32_t UARTCC26XX_write(UART_Handle handle, const void *buffer,
        size_t size);
extern void UARTCC26XX_writeCancel(UART_Handle handle);
extern int_fast32_t UARTCC26XX_writePolling(UART_Handle handle, const void *buffer,
        size_t size);

/* UART function table for UARTMP432 implementation */
const UART_FxnTable myUARTCC26XX_fxnTable = {
    UARTCC26XX_close,
    UARTCC26XX_control,
    UARTCC26XX_init,
    UARTCC26XX_open,
    UARTCC26XX_read,
    NULL, /* UARTCC26XX_readPolling, */
    NULL, /* UARTCC26XX_readCancel, */
    UARTCC26XX_write,
    NULL, /* UARTCC26XX_writePolling, */
    NULL /* UARTCC26XX_writeCancel, */
};

/* UART objects */
UARTCC26XX_Object uartCC26XXObjects[CC1350STK_UARTCOUNT];
unsigned char uartCC26XXRingBuffer[CC1350STK_UARTCOUNT][32];

/* UART hardware parameter structure, also used to assign UART pins */
const UARTCC26XX_HWAttrsV2 uartCC26XXHWAttrs[CC1350STK_UARTCOUNT] = {
    {   /* CC1350STK_UART0 */
        .baseAddr = UART0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UART0,
        .intNum = INT_UART0_COMB,    /* <driverlib>/inc/hw_ints.h */
        .intPriority = (0xc0),
        .swiPriority = 0,
        .txPin = Board_DP5_UARTTX,
        .rxPin = Board_DP4_UARTRX,
        .ctsPin = PIN_UNASSIGNED,
        .rtsPin = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[0],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[0])
    },
};

/* UART configuration structure */
const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &myUARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[0],
        .hwAttrs     = &uartCC26XXHWAttrs[0]
    },
};

const uint_least8_t UART_count = CC1350STK_UARTCOUNT;

/*
 *  ============================= UDMA ===================================
*/

/* Include drivers */
#include <ti/drivers/dma/UDMACC26XX.h>

/* UDMA objects */
UDMACC26XX_Object udmaObjects[CC1350STK_UDMACOUNT];

/* UDMA configuration structure */
const UDMACC26XX_HWAttrs udmaHWAttrs[CC1350STK_UDMACOUNT] = {
    {
        .baseAddr = UDMA0_BASE, 
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum = INT_DMA_ERR,    /* <driverlib>/inc/hw_ints.h */
        .intPriority = (~0)
    },
};

/* UDMA configuration structure */
const UDMACC26XX_Config UDMACC26XX_config[] = {
    {
        .object  = &udmaObjects[0],
        .hwAttrs = &udmaHWAttrs[0]
    },
};

/*
 *  ========================== SPI DMA ===================================
*/

/* Include drivers */
#include <ti/drivers/spi/SPICC26XXDMA.h>

/* SPICC26XXDMA functions */
extern void SPICC26XXDMA_close(SPI_Handle handle);
extern int_fast16_t SPICC26XXDMA_control(SPI_Handle handle, uint_fast16_t cmd, void *arg);
extern void SPICC26XXDMA_init(SPI_Handle handle);
extern SPI_Handle SPICC26XXDMA_open(SPI_Handle handle, SPI_Params *params);
extern bool SPICC26XXDMA_transfer(SPI_Handle handle, SPI_Transaction *transaction);
extern void SPICC26XXDMA_transferCancel(SPI_Handle handle);

/* SPI function table for SPICC26XXDMA implementation */
const SPI_FxnTable mySPICC26XXDMA_fxnTable = {
    SPICC26XXDMA_close,
    NULL, /* SPICC26XXDMA_control, */
    SPICC26XXDMA_init,
    SPICC26XXDMA_open,
    SPICC26XXDMA_transfer,
    NULL /* SPICC26XXDMA_transferCancel */
};

/* SPI objects */
SPICC26XXDMA_Object spiCC26XXDMAObjects[CC1350STK_SPICOUNT];

/* SPI configuration structure, describing which pins are to be used */
const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC1350STK_SPICOUNT] = {
    {   /* SENSORTAG_CC1350STK_SPI0 */
        .baseAddr = SSI0_BASE,
        .intNum = INT_SSI0_COMB,   /* <driverlib>/inc/hw_ints.h */
        .intPriority = 0xC0,       /* make SPI interrupt one priority higher than default */
        .swiPriority        = 0,
        .powerMngrId = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0,
        .rxChannelBitMask = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin = Board_SPI0_MOSI,
        .misoPin = Board_SPI0_MISO,
        .clkPin = Board_SPI0_CLK,
        .csnPin = PIN_UNASSIGNED     /* External flash / DevPk uses SPI0 */
    },
    {   /* SENSORTAG_CC1350STK_SPI1 */
        .baseAddr = SSI1_BASE,
        .intNum = INT_SSI1_COMB,     /* <driverlib>/inc/hw_ints.h */
        .intPriority = ~0,
        .swiPriority        = 0,
        .powerMngrId = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue = 0,
        .rxChannelBitMask  = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask  = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin = Board_SPI1_MOSI,
        .misoPin = Board_SPI1_MISO,
        .clkPin = Board_SPI1_CLK,
        .csnPin = Board_SPI1_CSN
    }
};

/* SPI configuration structure */
const SPI_Config SPI_config[] = {
    /* SENSORTAG_CC1350STK_SPI0 */
    {
        .fxnTablePtr = &mySPICC26XXDMA_fxnTable, 
        .object      = &spiCC26XXDMAObjects[0], 
        .hwAttrs     = &spiCC26XXDMAHWAttrs[0]
    },
    /* SENSORTAG_CC1350STK_SPI1 */
    {
        .fxnTablePtr = &mySPICC26XXDMA_fxnTable, 
        .object      = &spiCC26XXDMAObjects[1], 
        .hwAttrs     = &spiCC26XXDMAHWAttrs[2]
    },
};

